{
  "tf_version": "2.2.0",
  "kashgari_version": "2.0.2",
  "__class_name__": "BiGRU_Model",
  "__module__": "kashgari.tasks.classification.bi_gru_model",
  "config": {
    "hyper_parameters": {
      "layer_bi_gru": {
        "units": 128,
        "return_sequences": false
      },
      "layer_output": {}
    },
    "sequence_length": 100,
    "multi_label": false
  },
  "embedding": {
    "__class_name__": "BertEmbedding",
    "__module__": "kashgari.embeddings.bert_embedding",
    "config": {
      "segment": true,
      "embedding_size": 768,
      "max_position": 512,
      "vocab_path": "model/BERT_pretrain/vocab.txt",
      "config_path": "model/BERT_pretrain/bert_config.json",
      "checkpoint_path": "model/BERT_pretrain/bert_model.ckpt",
      "model_type": "bert",
      "model_folder": "model/BERT_pretrain"
    },
    "embed_model": {
      "class_name": "Model",
      "config": {
        "name": "model",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                null
              ],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "Input-Token"
            },
            "name": "Input-Token",
            "inbound_nodes": []
          },
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                null
              ],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "Input-Segment"
            },
            "name": "Input-Segment",
            "inbound_nodes": []
          },
          {
            "class_name": "Embedding",
            "config": {
              "name": "Embedding-Token",
              "trainable": false,
              "batch_input_shape": [
                null,
                null
              ],
              "dtype": "float32",
              "input_dim": 21128,
              "output_dim": 768,
              "embeddings_initializer": {
                "class_name": "TruncatedNormal",
                "config": {
                  "mean": 0.0,
                  "stddev": 0.02,
                  "seed": null
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": true,
              "input_length": null
            },
            "name": "Embedding-Token",
            "inbound_nodes": [
              [
                [
                  "Input-Token",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Embedding",
            "config": {
              "name": "Embedding-Segment",
              "trainable": false,
              "batch_input_shape": [
                null,
                null
              ],
              "dtype": "float32",
              "input_dim": 2,
              "output_dim": 768,
              "embeddings_initializer": {
                "class_name": "TruncatedNormal",
                "config": {
                  "mean": 0.0,
                  "stddev": 0.02,
                  "seed": null
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": null
            },
            "name": "Embedding-Segment",
            "inbound_nodes": [
              [
                [
                  "Input-Segment",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Add",
            "config": {
              "name": "Embedding-Token-Segment",
              "trainable": false,
              "dtype": "float32"
            },
            "name": "Embedding-Token-Segment",
            "inbound_nodes": [
              [
                [
                  "Embedding-Token",
                  0,
                  0,
                  {}
                ],
                [
                  "Embedding-Segment",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "PositionEmbedding",
            "config": {
              "name": "Embedding-Position",
              "trainable": false,
              "dtype": "float32",
              "input_dim": 512,
              "output_dim": 768,
              "merge_mode": "add",
              "hierarchical": null,
              "embeddings_initializer": {
                "class_name": "TruncatedNormal",
                "config": {
                  "mean": 0.0,
                  "stddev": 0.02,
                  "seed": null
                }
              },
              "custom_position_ids": false
            },
            "name": "Embedding-Position",
            "inbound_nodes": [
              [
                [
                  "Embedding-Token-Segment",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "LayerNormalization",
            "config": {
              "name": "Embedding-Norm",
              "trainable": false,
              "dtype": "float32",
              "center": true,
              "scale": true,
              "epsilon": 1e-12,
              "conditional": false,
              "hidden_units": null,
              "hidden_activation": "linear",
              "hidden_initializer": {
                "class_name": "TruncatedNormal",
                "config": {
                  "mean": 0.0,
                  "stddev": 0.02,
                  "seed": null
                }
              }
            },
            "name": "Embedding-Norm",
            "inbound_nodes": [
              [
                [
                  "Embedding-Position",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "Embedding-Dropout",
              "trainable": false,
              "dtype": "float32",
              "rate": 0.1,
              "noise_shape": null,
              "seed": null
            },
            "name": "Embedding-Dropout",
            "inbound_nodes": [
              [
                [
                  "Embedding-Norm",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "MultiHeadAttention",
            "config": {
              "name": "Transformer-0-MultiHeadSelfAttention",
              "trainable": false,
              "dtype": "float32",
              "heads": 12,
              "head_size": 64,
              "out_dim": 768,
              "key_size": 64,
              "use_bias": true,
              "attention_scale": true,
              "return_attention_scores": false,
              "kernel_initializer": {
                "class_name": "TruncatedNormal",
                "config": {
                  "mean": 0.0,
                  "stddev": 0.02,
                  "seed": null
                }
              }
            },
            "name": "Transformer-0-MultiHeadSelfAttention",
            "inbound_nodes": [
              [
                [
                  "Embedding-Dropout",
                  0,
                  0,
                  {
                    "a_bias": null
                  }
                ],
                [
                  "Embedding-Dropout",
                  0,
                  0,
                  {
                    "a_bias": null
                  }
                ],
                [
                  "Embedding-Dropout",
                  0,
                  0,
                  {
                    "a_bias": null
                  }
                ]
              ]
            ]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "Transformer-0-MultiHeadSelfAttention-Dropout",
              "trainable": false,
              "dtype": "float32",
              "rate": 0.1,
              "noise_shape": null,
              "seed": null
            },
            "name": "Transformer-0-MultiHeadSelfAttention-Dropout",
            "inbound_nodes": [
              [
                [
                  "Transformer-0-MultiHeadSelfAttention",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Add",
            "config": {
              "name": "Transformer-0-MultiHeadSelfAttention-Add",
              "trainable": false,
              "dtype": "float32"
            },
            "name": "Transformer-0-MultiHeadSelfAttention-Add",
            "inbound_nodes": [
              [
                [
                  "Embedding-Dropout",
                  0,
                  0,
                  {}
                ],
                [
                  "Transformer-0-MultiHeadSelfAttention-Dropout",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "LayerNormalization",
            "config": {
              "name": "Transformer-0-MultiHeadSelfAttention-Norm",
              "trainable": false,
              "dtype": "float32",
              "center": true,
              "scale": true,
              "epsilon": 1e-12,
              "conditional": false,
              "hidden_units": null,
              "hidden_activation": "linear",
              "hidden_initializer": {
                "class_name": "TruncatedNormal",
                "config": {
                  "mean": 0.0,
                  "stddev": 0.02,
                  "seed": null
                }
              }
            },
            "name": "Transformer-0-MultiHeadSelfAttention-Norm",
            "inbound_nodes": [
              [
                [
                  "Transformer-0-MultiHeadSelfAttention-Add",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "FeedForward",
            "config": {
              "name": "Transformer-0-FeedForward",
              "trainable": false,
              "dtype": "float32",
              "units": 3072,
              "activation": [
                "gelu_erf"
              ],
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "TruncatedNormal",
                "config": {
                  "mean": 0.0,
                  "stddev": 0.02,
                  "seed": null
                }
              }
            },
            "name": "Transformer-0-FeedForward",
            "inbound_nodes": [
              [
                [
                  "Transformer-0-MultiHeadSelfAttention-Norm",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "Transformer-0-FeedForward-Dropout",
              "trainable": false,
              "dtype": "float32",
              "rate": 0.1,
              "noise_shape": null,
              "seed": null
            },
            "name": "Transformer-0-FeedForward-Dropout",
            "inbound_nodes": [
              [
                [
                  "Transformer-0-FeedForward",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Add",
            "config": {
              "name": "Transformer-0-FeedForward-Add",
              "trainable": false,
              "dtype": "float32"
            },
            "name": "Transformer-0-FeedForward-Add",
            "inbound_nodes": [
              [
                [
                  "Transformer-0-MultiHeadSelfAttention-Norm",
                  0,
                  0,
                  {}
                ],
                [
                  "Transformer-0-FeedForward-Dropout",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "LayerNormalization",
            "config": {
              "name": "Transformer-0-FeedForward-Norm",
              "trainable": false,
              "dtype": "float32",
              "center": true,
              "scale": true,
              "epsilon": 1e-12,
              "conditional": false,
              "hidden_units": null,
              "hidden_activation": "linear",
              "hidden_initializer": {
                "class_name": "TruncatedNormal",
                "config": {
                  "mean": 0.0,
                  "stddev": 0.02,
                  "seed": null
                }
              }
            },
            "name": "Transformer-0-FeedForward-Norm",
            "inbound_nodes": [
              [
                [
                  "Transformer-0-FeedForward-Add",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "MultiHeadAttention",
            "config": {
              "name": "Transformer-1-MultiHeadSelfAttention",
              "trainable": false,
              "dtype": "float32",
              "heads": 12,
              "head_size": 64,
              "out_dim": 768,
              "key_size": 64,
              "use_bias": true,
              "attention_scale": true,
              "return_attention_scores": false,
              "kernel_initializer": {
                "class_name": "TruncatedNormal",
                "config": {
                  "mean": 0.0,
                  "stddev": 0.02,
                  "seed": null
                }
              }
            },
            "name": "Transformer-1-MultiHeadSelfAttention",
            "inbound_nodes": [
              [
                [
                  "Transformer-0-FeedForward-Norm",
                  0,
                  0,
                  {
                    "a_bias": null
                  }
                ],
                [
                  "Transformer-0-FeedForward-Norm",
                  0,
                  0,
                  {
                    "a_bias": null
                  }
                ],
                [
                  "Transformer-0-FeedForward-Norm",
                  0,
                  0,
                  {
                    "a_bias": null
                  }
                ]
              ]
            ]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "Transformer-1-MultiHeadSelfAttention-Dropout",
              "trainable": false,
              "dtype": "float32",
              "rate": 0.1,
              "noise_shape": null,
              "seed": null
            },
            "name": "Transformer-1-MultiHeadSelfAttention-Dropout",
            "inbound_nodes": [
              [
                [
                  "Transformer-1-MultiHeadSelfAttention",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Add",
            "config": {
              "name": "Transformer-1-MultiHeadSelfAttention-Add",
              "trainable": false,
              "dtype": "float32"
            },
            "name": "Transformer-1-MultiHeadSelfAttention-Add",
            "inbound_nodes": [
              [
                [
                  "Transformer-0-FeedForward-Norm",
                  0,
                  0,
                  {}
                ],
                [
                  "Transformer-1-MultiHeadSelfAttention-Dropout",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "LayerNormalization",
            "config": {
              "name": "Transformer-1-MultiHeadSelfAttention-Norm",
              "trainable": false,
              "dtype": "float32",
              "center": true,
              "scale": true,
              "epsilon": 1e-12,
              "conditional": false,
              "hidden_units": null,
              "hidden_activation": "linear",
              "hidden_initializer": {
                "class_name": "TruncatedNormal",
                "config": {
                  "mean": 0.0,
                  "stddev": 0.02,
                  "seed": null
                }
              }
            },
            "name": "Transformer-1-MultiHeadSelfAttention-Norm",
            "inbound_nodes": [
              [
                [
                  "Transformer-1-MultiHeadSelfAttention-Add",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "FeedForward",
            "config": {
              "name": "Transformer-1-FeedForward",
              "trainable": false,
              "dtype": "float32",
              "units": 3072,
              "activation": [
                "gelu_erf"
              ],
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "TruncatedNormal",
                "config": {
                  "mean": 0.0,
                  "stddev": 0.02,
                  "seed": null
                }
              }
            },
            "name": "Transformer-1-FeedForward",
            "inbound_nodes": [
              [
                [
                  "Transformer-1-MultiHeadSelfAttention-Norm",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "Transformer-1-FeedForward-Dropout",
              "trainable": false,
              "dtype": "float32",
              "rate": 0.1,
              "noise_shape": null,
              "seed": null
            },
            "name": "Transformer-1-FeedForward-Dropout",
            "inbound_nodes": [
              [
                [
                  "Transformer-1-FeedForward",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Add",
            "config": {
              "name": "Transformer-1-FeedForward-Add",
              "trainable": false,
              "dtype": "float32"
            },
            "name": "Transformer-1-FeedForward-Add",
            "inbound_nodes": [
              [
                [
                  "Transformer-1-MultiHeadSelfAttention-Norm",
                  0,
                  0,
                  {}
                ],
                [
                  "Transformer-1-FeedForward-Dropout",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "LayerNormalization",
            "config": {
              "name": "Transformer-1-FeedForward-Norm",
              "trainable": false,
              "dtype": "float32",
              "center": true,
              "scale": true,
              "epsilon": 1e-12,
              "conditional": false,
              "hidden_units": null,
              "hidden_activation": "linear",
              "hidden_initializer": {
                "class_name": "TruncatedNormal",
                "config": {
                  "mean": 0.0,
                  "stddev": 0.02,
                  "seed": null
                }
              }
            },
            "name": "Transformer-1-FeedForward-Norm",
            "inbound_nodes": [
              [
                [
                  "Transformer-1-FeedForward-Add",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "MultiHeadAttention",
            "config": {
              "name": "Transformer-2-MultiHeadSelfAttention",
              "trainable": false,
              "dtype": "float32",
              "heads": 12,
              "head_size": 64,
              "out_dim": 768,
              "key_size": 64,
              "use_bias": true,
              "attention_scale": true,
              "return_attention_scores": false,
              "kernel_initializer": {
                "class_name": "TruncatedNormal",
                "config": {
                  "mean": 0.0,
                  "stddev": 0.02,
                  "seed": null
                }
              }
            },
            "name": "Transformer-2-MultiHeadSelfAttention",
            "inbound_nodes": [
              [
                [
                  "Transformer-1-FeedForward-Norm",
                  0,
                  0,
                  {
                    "a_bias": null
                  }
                ],
                [
                  "Transformer-1-FeedForward-Norm",
                  0,
                  0,
                  {
                    "a_bias": null
                  }
                ],
                [
                  "Transformer-1-FeedForward-Norm",
                  0,
                  0,
                  {
                    "a_bias": null
                  }
                ]
              ]
            ]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "Transformer-2-MultiHeadSelfAttention-Dropout",
              "trainable": false,
              "dtype": "float32",
              "rate": 0.1,
              "noise_shape": null,
              "seed": null
            },
            "name": "Transformer-2-MultiHeadSelfAttention-Dropout",
            "inbound_nodes": [
              [
                [
                  "Transformer-2-MultiHeadSelfAttention",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Add",
            "config": {
              "name": "Transformer-2-MultiHeadSelfAttention-Add",
              "trainable": false,
              "dtype": "float32"
            },
            "name": "Transformer-2-MultiHeadSelfAttention-Add",
            "inbound_nodes": [
              [
                [
                  "Transformer-1-FeedForward-Norm",
                  0,
                  0,
                  {}
                ],
                [
                  "Transformer-2-MultiHeadSelfAttention-Dropout",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "LayerNormalization",
            "config": {
              "name": "Transformer-2-MultiHeadSelfAttention-Norm",
              "trainable": false,
              "dtype": "float32",
              "center": true,
              "scale": true,
              "epsilon": 1e-12,
              "conditional": false,
              "hidden_units": null,
              "hidden_activation": "linear",
              "hidden_initializer": {
                "class_name": "TruncatedNormal",
                "config": {
                  "mean": 0.0,
                  "stddev": 0.02,
                  "seed": null
                }
              }
            },
            "name": "Transformer-2-MultiHeadSelfAttention-Norm",
            "inbound_nodes": [
              [
                [
                  "Transformer-2-MultiHeadSelfAttention-Add",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "FeedForward",
            "config": {
              "name": "Transformer-2-FeedForward",
              "trainable": false,
              "dtype": "float32",
              "units": 3072,
              "activation": [
                "gelu_erf"
              ],
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "TruncatedNormal",
                "config": {
                  "mean": 0.0,
                  "stddev": 0.02,
                  "seed": null
                }
              }
            },
            "name": "Transformer-2-FeedForward",
            "inbound_nodes": [
              [
                [
                  "Transformer-2-MultiHeadSelfAttention-Norm",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "Transformer-2-FeedForward-Dropout",
              "trainable": false,
              "dtype": "float32",
              "rate": 0.1,
              "noise_shape": null,
              "seed": null
            },
            "name": "Transformer-2-FeedForward-Dropout",
            "inbound_nodes": [
              [
                [
                  "Transformer-2-FeedForward",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Add",
            "config": {
              "name": "Transformer-2-FeedForward-Add",
              "trainable": false,
              "dtype": "float32"
            },
            "name": "Transformer-2-FeedForward-Add",
            "inbound_nodes": [
              [
                [
                  "Transformer-2-MultiHeadSelfAttention-Norm",
                  0,
                  0,
                  {}
                ],
                [
                  "Transformer-2-FeedForward-Dropout",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "LayerNormalization",
            "config": {
              "name": "Transformer-2-FeedForward-Norm",
              "trainable": false,
              "dtype": "float32",
              "center": true,
              "scale": true,
              "epsilon": 1e-12,
              "conditional": false,
              "hidden_units": null,
              "hidden_activation": "linear",
              "hidden_initializer": {
                "class_name": "TruncatedNormal",
                "config": {
                  "mean": 0.0,
                  "stddev": 0.02,
                  "seed": null
                }
              }
            },
            "name": "Transformer-2-FeedForward-Norm",
            "inbound_nodes": [
              [
                [
                  "Transformer-2-FeedForward-Add",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "MultiHeadAttention",
            "config": {
              "name": "Transformer-3-MultiHeadSelfAttention",
              "trainable": false,
              "dtype": "float32",
              "heads": 12,
              "head_size": 64,
              "out_dim": 768,
              "key_size": 64,
              "use_bias": true,
              "attention_scale": true,
              "return_attention_scores": false,
              "kernel_initializer": {
                "class_name": "TruncatedNormal",
                "config": {
                  "mean": 0.0,
                  "stddev": 0.02,
                  "seed": null
                }
              }
            },
            "name": "Transformer-3-MultiHeadSelfAttention",
            "inbound_nodes": [
              [
                [
                  "Transformer-2-FeedForward-Norm",
                  0,
                  0,
                  {
                    "a_bias": null
                  }
                ],
                [
                  "Transformer-2-FeedForward-Norm",
                  0,
                  0,
                  {
                    "a_bias": null
                  }
                ],
                [
                  "Transformer-2-FeedForward-Norm",
                  0,
                  0,
                  {
                    "a_bias": null
                  }
                ]
              ]
            ]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "Transformer-3-MultiHeadSelfAttention-Dropout",
              "trainable": false,
              "dtype": "float32",
              "rate": 0.1,
              "noise_shape": null,
              "seed": null
            },
            "name": "Transformer-3-MultiHeadSelfAttention-Dropout",
            "inbound_nodes": [
              [
                [
                  "Transformer-3-MultiHeadSelfAttention",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Add",
            "config": {
              "name": "Transformer-3-MultiHeadSelfAttention-Add",
              "trainable": false,
              "dtype": "float32"
            },
            "name": "Transformer-3-MultiHeadSelfAttention-Add",
            "inbound_nodes": [
              [
                [
                  "Transformer-2-FeedForward-Norm",
                  0,
                  0,
                  {}
                ],
                [
                  "Transformer-3-MultiHeadSelfAttention-Dropout",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "LayerNormalization",
            "config": {
              "name": "Transformer-3-MultiHeadSelfAttention-Norm",
              "trainable": false,
              "dtype": "float32",
              "center": true,
              "scale": true,
              "epsilon": 1e-12,
              "conditional": false,
              "hidden_units": null,
              "hidden_activation": "linear",
              "hidden_initializer": {
                "class_name": "TruncatedNormal",
                "config": {
                  "mean": 0.0,
                  "stddev": 0.02,
                  "seed": null
                }
              }
            },
            "name": "Transformer-3-MultiHeadSelfAttention-Norm",
            "inbound_nodes": [
              [
                [
                  "Transformer-3-MultiHeadSelfAttention-Add",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "FeedForward",
            "config": {
              "name": "Transformer-3-FeedForward",
              "trainable": false,
              "dtype": "float32",
              "units": 3072,
              "activation": [
                "gelu_erf"
              ],
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "TruncatedNormal",
                "config": {
                  "mean": 0.0,
                  "stddev": 0.02,
                  "seed": null
                }
              }
            },
            "name": "Transformer-3-FeedForward",
            "inbound_nodes": [
              [
                [
                  "Transformer-3-MultiHeadSelfAttention-Norm",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "Transformer-3-FeedForward-Dropout",
              "trainable": false,
              "dtype": "float32",
              "rate": 0.1,
              "noise_shape": null,
              "seed": null
            },
            "name": "Transformer-3-FeedForward-Dropout",
            "inbound_nodes": [
              [
                [
                  "Transformer-3-FeedForward",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Add",
            "config": {
              "name": "Transformer-3-FeedForward-Add",
              "trainable": false,
              "dtype": "float32"
            },
            "name": "Transformer-3-FeedForward-Add",
            "inbound_nodes": [
              [
                [
                  "Transformer-3-MultiHeadSelfAttention-Norm",
                  0,
                  0,
                  {}
                ],
                [
                  "Transformer-3-FeedForward-Dropout",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "LayerNormalization",
            "config": {
              "name": "Transformer-3-FeedForward-Norm",
              "trainable": false,
              "dtype": "float32",
              "center": true,
              "scale": true,
              "epsilon": 1e-12,
              "conditional": false,
              "hidden_units": null,
              "hidden_activation": "linear",
              "hidden_initializer": {
                "class_name": "TruncatedNormal",
                "config": {
                  "mean": 0.0,
                  "stddev": 0.02,
                  "seed": null
                }
              }
            },
            "name": "Transformer-3-FeedForward-Norm",
            "inbound_nodes": [
              [
                [
                  "Transformer-3-FeedForward-Add",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "MultiHeadAttention",
            "config": {
              "name": "Transformer-4-MultiHeadSelfAttention",
              "trainable": false,
              "dtype": "float32",
              "heads": 12,
              "head_size": 64,
              "out_dim": 768,
              "key_size": 64,
              "use_bias": true,
              "attention_scale": true,
              "return_attention_scores": false,
              "kernel_initializer": {
                "class_name": "TruncatedNormal",
                "config": {
                  "mean": 0.0,
                  "stddev": 0.02,
                  "seed": null
                }
              }
            },
            "name": "Transformer-4-MultiHeadSelfAttention",
            "inbound_nodes": [
              [
                [
                  "Transformer-3-FeedForward-Norm",
                  0,
                  0,
                  {
                    "a_bias": null
                  }
                ],
                [
                  "Transformer-3-FeedForward-Norm",
                  0,
                  0,
                  {
                    "a_bias": null
                  }
                ],
                [
                  "Transformer-3-FeedForward-Norm",
                  0,
                  0,
                  {
                    "a_bias": null
                  }
                ]
              ]
            ]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "Transformer-4-MultiHeadSelfAttention-Dropout",
              "trainable": false,
              "dtype": "float32",
              "rate": 0.1,
              "noise_shape": null,
              "seed": null
            },
            "name": "Transformer-4-MultiHeadSelfAttention-Dropout",
            "inbound_nodes": [
              [
                [
                  "Transformer-4-MultiHeadSelfAttention",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Add",
            "config": {
              "name": "Transformer-4-MultiHeadSelfAttention-Add",
              "trainable": false,
              "dtype": "float32"
            },
            "name": "Transformer-4-MultiHeadSelfAttention-Add",
            "inbound_nodes": [
              [
                [
                  "Transformer-3-FeedForward-Norm",
                  0,
                  0,
                  {}
                ],
                [
                  "Transformer-4-MultiHeadSelfAttention-Dropout",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "LayerNormalization",
            "config": {
              "name": "Transformer-4-MultiHeadSelfAttention-Norm",
              "trainable": false,
              "dtype": "float32",
              "center": true,
              "scale": true,
              "epsilon": 1e-12,
              "conditional": false,
              "hidden_units": null,
              "hidden_activation": "linear",
              "hidden_initializer": {
                "class_name": "TruncatedNormal",
                "config": {
                  "mean": 0.0,
                  "stddev": 0.02,
                  "seed": null
                }
              }
            },
            "name": "Transformer-4-MultiHeadSelfAttention-Norm",
            "inbound_nodes": [
              [
                [
                  "Transformer-4-MultiHeadSelfAttention-Add",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "FeedForward",
            "config": {
              "name": "Transformer-4-FeedForward",
              "trainable": false,
              "dtype": "float32",
              "units": 3072,
              "activation": [
                "gelu_erf"
              ],
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "TruncatedNormal",
                "config": {
                  "mean": 0.0,
                  "stddev": 0.02,
                  "seed": null
                }
              }
            },
            "name": "Transformer-4-FeedForward",
            "inbound_nodes": [
              [
                [
                  "Transformer-4-MultiHeadSelfAttention-Norm",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "Transformer-4-FeedForward-Dropout",
              "trainable": false,
              "dtype": "float32",
              "rate": 0.1,
              "noise_shape": null,
              "seed": null
            },
            "name": "Transformer-4-FeedForward-Dropout",
            "inbound_nodes": [
              [
                [
                  "Transformer-4-FeedForward",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Add",
            "config": {
              "name": "Transformer-4-FeedForward-Add",
              "trainable": false,
              "dtype": "float32"
            },
            "name": "Transformer-4-FeedForward-Add",
            "inbound_nodes": [
              [
                [
                  "Transformer-4-MultiHeadSelfAttention-Norm",
                  0,
                  0,
                  {}
                ],
                [
                  "Transformer-4-FeedForward-Dropout",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "LayerNormalization",
            "config": {
              "name": "Transformer-4-FeedForward-Norm",
              "trainable": false,
              "dtype": "float32",
              "center": true,
              "scale": true,
              "epsilon": 1e-12,
              "conditional": false,
              "hidden_units": null,
              "hidden_activation": "linear",
              "hidden_initializer": {
                "class_name": "TruncatedNormal",
                "config": {
                  "mean": 0.0,
                  "stddev": 0.02,
                  "seed": null
                }
              }
            },
            "name": "Transformer-4-FeedForward-Norm",
            "inbound_nodes": [
              [
                [
                  "Transformer-4-FeedForward-Add",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "MultiHeadAttention",
            "config": {
              "name": "Transformer-5-MultiHeadSelfAttention",
              "trainable": false,
              "dtype": "float32",
              "heads": 12,
              "head_size": 64,
              "out_dim": 768,
              "key_size": 64,
              "use_bias": true,
              "attention_scale": true,
              "return_attention_scores": false,
              "kernel_initializer": {
                "class_name": "TruncatedNormal",
                "config": {
                  "mean": 0.0,
                  "stddev": 0.02,
                  "seed": null
                }
              }
            },
            "name": "Transformer-5-MultiHeadSelfAttention",
            "inbound_nodes": [
              [
                [
                  "Transformer-4-FeedForward-Norm",
                  0,
                  0,
                  {
                    "a_bias": null
                  }
                ],
                [
                  "Transformer-4-FeedForward-Norm",
                  0,
                  0,
                  {
                    "a_bias": null
                  }
                ],
                [
                  "Transformer-4-FeedForward-Norm",
                  0,
                  0,
                  {
                    "a_bias": null
                  }
                ]
              ]
            ]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "Transformer-5-MultiHeadSelfAttention-Dropout",
              "trainable": false,
              "dtype": "float32",
              "rate": 0.1,
              "noise_shape": null,
              "seed": null
            },
            "name": "Transformer-5-MultiHeadSelfAttention-Dropout",
            "inbound_nodes": [
              [
                [
                  "Transformer-5-MultiHeadSelfAttention",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Add",
            "config": {
              "name": "Transformer-5-MultiHeadSelfAttention-Add",
              "trainable": false,
              "dtype": "float32"
            },
            "name": "Transformer-5-MultiHeadSelfAttention-Add",
            "inbound_nodes": [
              [
                [
                  "Transformer-4-FeedForward-Norm",
                  0,
                  0,
                  {}
                ],
                [
                  "Transformer-5-MultiHeadSelfAttention-Dropout",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "LayerNormalization",
            "config": {
              "name": "Transformer-5-MultiHeadSelfAttention-Norm",
              "trainable": false,
              "dtype": "float32",
              "center": true,
              "scale": true,
              "epsilon": 1e-12,
              "conditional": false,
              "hidden_units": null,
              "hidden_activation": "linear",
              "hidden_initializer": {
                "class_name": "TruncatedNormal",
                "config": {
                  "mean": 0.0,
                  "stddev": 0.02,
                  "seed": null
                }
              }
            },
            "name": "Transformer-5-MultiHeadSelfAttention-Norm",
            "inbound_nodes": [
              [
                [
                  "Transformer-5-MultiHeadSelfAttention-Add",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "FeedForward",
            "config": {
              "name": "Transformer-5-FeedForward",
              "trainable": false,
              "dtype": "float32",
              "units": 3072,
              "activation": [
                "gelu_erf"
              ],
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "TruncatedNormal",
                "config": {
                  "mean": 0.0,
                  "stddev": 0.02,
                  "seed": null
                }
              }
            },
            "name": "Transformer-5-FeedForward",
            "inbound_nodes": [
              [
                [
                  "Transformer-5-MultiHeadSelfAttention-Norm",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "Transformer-5-FeedForward-Dropout",
              "trainable": false,
              "dtype": "float32",
              "rate": 0.1,
              "noise_shape": null,
              "seed": null
            },
            "name": "Transformer-5-FeedForward-Dropout",
            "inbound_nodes": [
              [
                [
                  "Transformer-5-FeedForward",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Add",
            "config": {
              "name": "Transformer-5-FeedForward-Add",
              "trainable": false,
              "dtype": "float32"
            },
            "name": "Transformer-5-FeedForward-Add",
            "inbound_nodes": [
              [
                [
                  "Transformer-5-MultiHeadSelfAttention-Norm",
                  0,
                  0,
                  {}
                ],
                [
                  "Transformer-5-FeedForward-Dropout",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "LayerNormalization",
            "config": {
              "name": "Transformer-5-FeedForward-Norm",
              "trainable": false,
              "dtype": "float32",
              "center": true,
              "scale": true,
              "epsilon": 1e-12,
              "conditional": false,
              "hidden_units": null,
              "hidden_activation": "linear",
              "hidden_initializer": {
                "class_name": "TruncatedNormal",
                "config": {
                  "mean": 0.0,
                  "stddev": 0.02,
                  "seed": null
                }
              }
            },
            "name": "Transformer-5-FeedForward-Norm",
            "inbound_nodes": [
              [
                [
                  "Transformer-5-FeedForward-Add",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "MultiHeadAttention",
            "config": {
              "name": "Transformer-6-MultiHeadSelfAttention",
              "trainable": false,
              "dtype": "float32",
              "heads": 12,
              "head_size": 64,
              "out_dim": 768,
              "key_size": 64,
              "use_bias": true,
              "attention_scale": true,
              "return_attention_scores": false,
              "kernel_initializer": {
                "class_name": "TruncatedNormal",
                "config": {
                  "mean": 0.0,
                  "stddev": 0.02,
                  "seed": null
                }
              }
            },
            "name": "Transformer-6-MultiHeadSelfAttention",
            "inbound_nodes": [
              [
                [
                  "Transformer-5-FeedForward-Norm",
                  0,
                  0,
                  {
                    "a_bias": null
                  }
                ],
                [
                  "Transformer-5-FeedForward-Norm",
                  0,
                  0,
                  {
                    "a_bias": null
                  }
                ],
                [
                  "Transformer-5-FeedForward-Norm",
                  0,
                  0,
                  {
                    "a_bias": null
                  }
                ]
              ]
            ]
          },
          {
            "class_name": "Dropout",
            "config": {
